/*Для всех задач исходные условия следующие: пользователь с клавиатуры
вводит размер массива (просто целое число). После того, как размер массива
задан, заполнить его одним из двух способов: используя Math.random(), или
каждый элемент массива вводится пользователем вручную. Попробовать оба
варианта. После заполнения массива данными, решить для него следующие
задачи:*/
//Пройти по массиву и поменять местами элементы первый и последний, второй и предпоследний и т.д.
package Work3;

class Task_5_v1 {

}

class Task_5_v2 {
}