/*Для всех задач исходные условия следующие: пользователь с клавиатуры
вводит размер массива (просто целое число). После того, как размер массива
задан, заполнить его одним из двух способов: используя Math.random(), или
каждый элемент массива вводится пользователем вручную. Попробовать оба
варианта. После заполнения массива данными, решить для него следующие
задачи:*/
//Проверить, является ли массив возрастающей последовательностью (каждое следующее число больше предыдущего).
package Work3;

class Task_6_v1 {

}

class Task_6_v2 {
}